#!/bin/bash
#########################
#
# 常用的函数集合
#
#
#########################

set -e          # set -o errexit 有错误退出
set -u          # set -o nounset
set -o pipefail #管道执行过程中有错误退出

echo $0" begining ..."

####################################################################################################
# log 自定义打日志日志函数 打印日志的日志文件在启动命令所在文件夹 日志名为 run.log
function log() {
    #echo "参数个数:"$#
    #配置文件位置和文件名
    #默认为当前目录下
    filePath=$(pwd)"/"
    fileName=run.log
    #日期格式 可修改
    date=$(date +"%Y-%m-%d %H:%M-%S")
    if [ $# -eq 1 ]; then
        # echo [$date]"[INFO]:脚本"$0"中:"$1
        echo [$date]"[INFO]:脚本"$0"中:"$1 >>$filePath$fileName
        return
    fi
    # echo [$date][$1]":脚本"$0"中:"$2
    echo [$date][$1]":脚本"$0"中:"$2 >>$filePath$fileName
}

#调用方式
log INFO info-message
log info-message
log ERROR error-message
log WARN warning-message
####################################################################################################

####################################################################################################
# err 简化版本的日志打印
function err() {
    echo "[$(date +'%Y-%m-%dT%H:%M:%S%z')]: $@" >&2
}
## 调用

err "错误信息"
####################################################################################################
